In [1]:
import pandas as pd

In [3]:
data = {'Date': ['2012-01-01', '2012-01-01', '2012-01-02', '2012-01-02'],
        'Category': ['A', 'B', 'A', 'B'],
        'Values': [10, 20, 30, 40]}
df = pd.DataFrame(data)

In [4]:
df

         Date Category  Values
0  2012-01-01        A      10
1  2012-01-01        B      20
2  2012-01-02        A      30
3  2012-01-02        B      40

In [5]:
df.shape

(4, 3)

In [8]:
pivot_df = pd.pivot_table(df, values='Values', index='Date', columns='Category', aggfunc='sum')

pivot_df

Category     A   B
Date
2012-01-01  10  20
2012-01-02  30  40

In [9]:
pivot_df.shape

(2, 2)